[
  {
    "title": "The Top Artificial Intelligence Trends | IBM",
    "content": "AI trends in 2025: What we’ve seen and what we’ll see next 21 May 2025 12 min read Link copied Authors Dave Bergmann Senior Writer, AI Models IBM Approaching the midpoint of 2025, we can look back at the prevailing artificial intelligence trends of the year so far—and look ahead to what the rest of the year might bring. Given the breadth and depth of AI development, no roundup of AI trends can hope to be exhaustive. This piece is no exception. We’ve narrowed things down to a list of 10: 5 developments that have driven the first half of the year, and 5 more that we expect to play a major role in the months to come. What we’ve seen so far: A dramatic decrease in inference costs More reasonable reasoning models An increasing drain on digital resources The return of mixture of experts (MoE) models AI action is trailing AI rhetoric What we’ll see next: Benchmark saturation and diversification Transcending transformer models Embodied AI, robotics and world models Privacy vs. personalization AI coworkers and emotional consequences Trends in AI are driven not only by advancements in AI models and algorithms themselves, but by the ever-expanding array of use cases to which generative AI (gen AI) capabilities are being applied. As models grow more capable, versatile and efficient, so too do the AI applications, AI tools and other AI-powered workflows they enable. A true understanding of how today’s AI ecosystem is evolving therefore requires a contextual understanding of the causes and effects of machine learning breakthroughs. This article primarily explores ongoing trends whose real-world impact might be realized on a horizon of months: in other words, trends with tangible impact mostly on or in the year 2025. There are, of course, other AI initiatives that are more evergreen and familiar. For example, though there has been recent movement on fully self-driving vehicles in isolated pockets—robotaxi pilots have been launched in a handful of U.S. cities, with additional trials abroad in Oslo, Geneva and 16 Chinese cities—they’re likely still years away from ubiquity. Many other important macro trends in AI—such as the advent of AI agents , or AI's disruption of search behaviors and SEO —are broad, multi-faceted and already well covered elsewhere, and so were left out in favor of more focused developments that haven't received such widespread media attention. That said, on with the list. The latest AI News + Insights Discover expertly curated insights and news on AI, cloud and more in the weekly Think Newsletter. Subscribe today What we've seen Progress doesn't necessarily require a constant influx of brand new ideas. Many of the most important AI trends in the first half of 2025 reflect changes in how the industry is applying existing ideas—some pragmatic and productive, others less so. Dramatic decrease in inference costs Today’s models are not only significantly better than the models of yesteryear, but also vastly cheaper to run. Consider this chart from SemiAnalysis: in under 2 years, the per-token pricing to achieve equivalent results on the MMLU benchmark decreased dozens of times over. This is hardly news to anyone who has been monitoring the performance metrics of each successive generation of model releases. But viewed in the aggregate, this constantly accelerating pace of improvement illustrates the case for generative AI hype better than viewing the already-impressive capabilities of present-day models. One study estimates the pace of algorithmic improvement at roughly 400% per year: in other words, today’s results can be achieved a year later using one fourth of the compute—and that’s without accounting for simultaneous improvements in computing (see: Moore’s Law ) or synthetic training data. The original GPT-4, rumored to have around 1.8 trillion parameters, 1 achieved a score of 67% on HumanEval, a popular benchmark for coding performance. IBM Granite 3.3 2B Instruct, released 2 years later and 900 times smaller, achieved a score of 80.5%. 2 This exponential expansion of model economy, more than anything, is what empowers the emerging era of AI agents . Large language models (LLMs) are becoming more practical even faster than they’re becoming more capable, which enables the deployment of complex multi-agent systems in which a cadre of models can plan, execute and coordinate on complex tasks autonomously—without skyrocketing inference costs. More reasonable reasoning models The release of OpenAI’s o1 introduced a new avenue for increasing model performance. Its head-turning improvement over prior state-of-the-art performance on highly technical math and coding benchmarks initiated an arms race in so-called “reasoning models.” Their enhanced performance on tasks requiring logical decision-making figures to play an important role in the development of agentic AI. But as is often the case with AI technology, the initial frenzy over raw performance has more recently given way to a search for the most practic",
    "description": "Adapting to emerging trends is essential to maximizing potential, minimizing risk and responsibly scaling generative AI adoption.",
    "url": "https://www.ibm.com/think/insights/artificial-intelligence-trends",
    "word_count": 4225,
    "status": "success",
    "internal_links": [
      "https://www.ibm.com/think/topics/ai-agents",
      "https://www.ibm.com/think/topics/large-language-models",
      "https://www.ibm.com/think/author/dave-bergmann",
      "https://www.ibm.com/think/topics/multiagent-system",
      "https://www.ibm.com/think/news/ai-new-search-experience",
      "https://www.ibm.com/think/topics/generative-ai",
      "https://www.ibm.com/think/topics/fine-tuning",
      "https://www.ibm.com/account/reg/signup",
      "https://www.ibm.com/think/topics/machine-learning",
      "https://www.ibm.com/think/ai-agents"
    ],
    "internal_links_count": 10,
    "search_title": "The Top Artificial Intelligence Trends - IBM",
    "search_snippet": "AI benchmark saturation and diversification · Transcending transformers · Embodied AI and world models · Privacy vs. personalized AI · AI coworkers and emotional ...",
    "search_position": 1,
    "crawled_at": "2025-05-24 11:58:31"
  },
  {
    "title": "Data and AI Trends 2024",
    "content": "Data and AI Trends 2024 Get the report Data and AI Trends 2024 Data is the fuel for AI, and what powers its effectiveness. To truly take advantage of generative AI, you need to ground AI in your enterprise data. We spoke to hundreds of data professionals to discover their predictions for 2024 and beyond. Scroll to explore English Deutsch Bahasa Indonesia Italiano 日本語 한국어 中文 (台灣) Your browser does not support the video tag.",
    "description": "Data is the fuel for AI, and what powers its effectiveness. To truly take advantage of generative AI, you need to ground AI in your enterprise data. We spoke to hundreds of data professionals to discover their predictions for 2024 and beyond.",
    "url": "https://data-ai-trends.withgoogle.com/",
    "word_count": 75,
    "status": "success",
    "internal_links": [
      "https://data-ai-trends.withgoogle.com/download-report"
    ],
    "internal_links_count": 1,
    "search_title": "Data and AI Trends 2024",
    "search_snippet": "Data is the fuel for AI, and what powers its effectiveness. To truly take advantage of generative AI, you need to ground AI in your enterprise data.",
    "search_position": 2,
    "crawled_at": "2025-05-24 11:58:33"
  },
  {
    "title": "The State of AI: Global survey | McKinsey",
    "content": "The state of AI: How organizations are rewiring to capture value March 12, 2025 | Survey Organizations are beginning to create the structures and processes that lead to meaningful value from gen AI. While still in early days, companies are redesigning workflows, elevating governance, and mitigating more risks. (26 pages) Organizations are starting to make organizational changes designed to generate future value from gen AI, and large companies are leading the way. The latest McKinsey Global Survey on AI finds that organizations are beginning to take steps that drive bottom-line impact—for example, redesigning workflows as they deploy gen AI and putting senior leaders in critical roles, such as overseeing AI governance. The findings also show that organizations are working to mitigate a growing set of gen-AI-related risks and are hiring for new AI-related roles while they retrain employees to participate in AI deployment. Companies with at least $500 million in annual revenue are changing more quickly than smaller organizations. Overall, the use of AI—that is, gen AI as well as analytical AI—continues to build momentum: More than three-quarters of respondents now say that their organizations use AI in at least one business function. The use of gen AI in particular is rapidly increasing. How companies are organizing their gen AI deployment—and who’s in charge About the authors This article is a collaborative effort by Alex Singla , Alexander Sukharevsky , Lareina Yee , and Michael Chui , with Bryce Hall , representing views from QuantumBlack, AI by McKinsey. Our survey analyses show that a CEO’s oversight of AI governance—that is, the policies, processes, and technology necessary to develop and deploy AI systems responsibly—is one element most correlated with higher self-reported bottom-line impact from an organization’s gen AI use. 1 The correlation analyses considered 25 attributes and the reported effect of gen AI use on organizations’ EBIT, and using the Johnson’s Relative Weights regression analysis yielded an R-squared of 0.20. The attributes included which leaders oversee AI governance at organizations, how organizations are managing the time saved by gen AI deployment (for example, assigning completely new activities and fewer hours to employees, reducing head count), whether organizations have fundamentally redesigned at least some of their workflows as a result of gen AI deployment, and whether they have adopted each of 12 gen AI adoption and scaling best practices: 1) establishing a dedicated team to drive gen AI adoption (for example, a project management office, transformation office, or dedicated adoption and scaling team); 2) having regular internal communications about the value created by their gen AI solutions to build awareness and momentum; 3) having senior leaders who are actively engaged in driving gen AI adoption, including role modeling the use of gen AI; 4) embedding gen AI solutions into business processes effectively (for example, changing frontline employees’ processes, creating user interfaces to incorporate gen AI solutions); 5) establishing role-based capability training courses to make sure employees at each level know how to use gen AI capabilities appropriately; 6) creating a comprehensive approach to foster trust among employees in our use of gen AI (for example, understanding primary sources, mitigating inaccuracies); 7) having a mechanism to incorporate feedback on the performance of gen AI solutions and improve them over time; 8) establishing a clearly defined road map to drive adoption of gen AI solutions (for example, with phased rollouts across teams and business units); 9) establishing a compelling change story about the need for gen AI adoption; 10) tracking well-defined KPIs for gen AI solutions, enabling insights into their adoption and ROI; 11) establishing employee incentives that reinforce gen AI adoption; and 12) creating a comprehensive approach to foster trust among customers in our use of gen AI (for example, transparency on regulatory compliance, use of customer data). That’s particularly true at larger companies, where CEO oversight is the element with the most impact on EBIT attributable to gen AI. Twenty-eight percent of respondents whose organizations use AI report that their CEO is responsible for overseeing AI governance, though the share is smaller at larger organizations with $500 million or more in annual revenues, and 17 percent say AI governance is overseen by their board of directors. In many cases, AI governance is jointly owned: On average, respondents report that two leaders are in charge. The value of AI comes from rewiring how companies run , and the latest survey shows that, out of 25 attributes tested for organizations of all sizes, the redesign of workflows has the biggest effect on an organization’s ability to see EBIT impact from its use of gen AI. Organizations are beginning to reshape their workflows as they deploy gen AI. Twenty-one",
    "description": "In this latest version of the annual McKinsey Global Survey on AI, we look at the current trends that are driving real value from artificial intelligence.",
    "url": "https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai",
    "word_count": 3401,
    "status": "success",
    "internal_links": [
      "https://www.mckinsey.com/our-people/bryce-hall",
      "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/when-will-we-see-mass-adoption-of-gen-ai",
      "https://www.mckinsey.com/our-people/michael-chui",
      "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/a-generative-ai-reset-rewiring-to-turn-potential-into-value-in-2024",
      "https://www.mckinsey.com/our-people/alexander-sukharevsky",
      "https://www.mckinsey.com/our-people/lareina-yee",
      "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/rewired-to-outcompete",
      "https://www.mckinsey.com/our-people/alex-singla",
      "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/superagency-in-the-workplace-empowering-people-to-unlock-ais-full-potential-at-work",
      "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/rewired-and-running-ahead-digital-and-ai-leaders-are-leaving-the-rest-behind"
    ],
    "internal_links_count": 10,
    "search_title": "The State of AI: Global survey | McKinsey",
    "search_snippet": "Responses show organizations using AI in an average of three business functions—an increase from early 2024, but still a minority of functions.",
    "search_position": 3,
    "crawled_at": "2025-05-24 11:58:34"
  }
]